<template>
  <h2 class="mb-4 text-3xl/8 font-bold text-center">
    Частые вопросы и ответы
  </h2>

  <UAccordion
    :items="items"
    :ui="{
      trigger: 'text-lg/6 font-serif',
      body: 'text-base/5',
    }"
  />
</template>

<script setup lang="ts">
const items = ref([
  {
    label: 'Когда начинается и заканчивается ваш адвент‑календарь?',
    content: 'Календарь стартует 1 декабря 2025 года и завершается в новогоднюю ночь — 31 декабря 2025 года. Каждый день открывается новое задание или сюрприз.',
    icon: 'i-lucide-circle-question-mark',
  },
  {
    label: 'Нужно ли регистрироваться, чтобы пользоваться календарем?',
    content: 'Да, регистрация требуется. Она супер простая и это полностью бесплатно. Плюс вы получите уникальный значок для профиля. После входа, заходите на эту страницу — и начинайте каждый день открывать новую карточку!',
    icon: 'i-lucide-circle-question-mark',
  },
  {
    label: 'Что делать, если я пропустил один или несколько дней?',
    content: 'Не переживайте! Все карточки остаются доступными до конца декабря. Вы можете вернуться к пропущенным дням и выполнить задания в удобное время.',
    icon: 'i-lucide-circle-question-mark',
  },
  {
    label: 'Есть ли мобильная версия календаря? Удобно ли пользоваться с телефона?',
    content: 'Да, календарь полностью адаптирован для смартфонов. На маленьких экранах карточки отображаются в одну колонку, текст остаётся читаемым, а кнопки — удобными для нажатия. Просто откройте страницу в любом мобильном браузере!',
    icon: 'i-lucide-circle-question-mark',
  },
  {
    label: 'Будут ли повторяться задания в разные дни?',
    content: 'Нет, каждое задание уникально. Мы постарались разнообразить активности: от творческих задач и рецептов до рефлексивных упражнений и маленьких добрых дел. Так каждый день остаётся интересным и непредсказуемым.',
    icon: 'i-lucide-circle-question-mark',
  },
  {
    label: 'Сохранятся ли задания после 31 декабря? Можно ли вернуться к ним в следующем году?',
    content: 'После 31 декабря 2025 года страница останется доступной, но новые задания открываться не будут. Вы можете сохранить понравившиеся идеи в заметках.',
    icon: 'i-lucide-circle-question-mark',
  },
])
</script>
