<template>
  <div class="flex flex-col gap-3.5">
    <h2 class="mb-4 text-3xl/8 font-bold text-left">
      Тайный архив новогодних чудес
    </h2>

    <p>
      Готовьтесь! В одном из декабрьских дней вас ждёт особое задание — маленькое приключение, которое позволит запечатлеть дух наступающего праздника.
    </p>

    <div>
      <strong>Что вас ждёт:</strong>
      <p>
        Вы сделаете снимок или выберете уже готовое фото, которое отражает праздничное настроение. Поделитесь им — и оно попадёт в общий альбом новогодних впечатлений.
      </p>
    </div>

    <div>
      <strong>Почему стоит поучаствовать?</strong>
      <p>
        Вы увидите, как по‑разному люди чувствуют и оформляют праздник. Плюс можно внести свой штрих в коллективную картину предновогоднего волшебства.
      </p>
    </div>

    <p class="italic">
      Ваши фотографии, при согласии, станут частью большого праздничного полотна — невидимой нити, которая связывает всех, кто ждёт чуда в декабре.
    </p>
  </div>
</template>
